#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

//int main()
//{
//	int a[4] = {1,2,3,4};
//	int *pt1 = (int*) (&a+1);//&a就是整个数组的地址，转换为整型地址，&a+1就是跳过数组之后的地址，跳过数组之后的地址，向左移动，就是指向的元素4
//	int *pt2 = (int*)((int)a+1);//1数组存储是01 00 00 00 2的存储是02 00 00 00.....//a就是表示首元素地址，就是代表，元素1的地址，转换为整型+1，就相当于地址向右移动一个字节，就到了01之后的00，十六进制表示的元素就是00 00 00 02，表示出来就是2000000
//	printf("%x,%x",pt1[-1],*pt2);
//	return 0;
//}

//int main()
//{
//	int a[3][2] = {(0,1),(2,3),(4,5)};//这个逗号表达式实际上是{1，3，5}；
//	int *p;
//	p = a[0];//第一行元素的首地址
//	printf("%d",p[0]);
//	return 0;
//}

//int main()
//{
//	int a[5][5];
//	int(*p)[4];
//	p = a;
//	printf("%p,%d\n",&p[4][2] - &a[4][2],&p[4][2] - &a[4][2]);//p[4][2] == *(*(p + 4)+2)  *p解引用应该是一个四个元素的数组
//	return 0;
//}


//int main()
//{
//	int a[2][5] = {1,2,3,4,5,6,7,8,9,10};
//	int *p = (int*)(&a + 1);//&a取出的是整个数组的地址，&a+1就是跳过这个数组的地址，地址向左挪一个位置，指向的就是元素10的地址
//	int *p2 = (int*)(*(a + 1));//a的地址是第一行的地址，a+1就是第二行的地址，，解引用就是6.
//	printf("%d,%d",*(p - 1),*(p2 - 1));
//	return 0;
//}

//int main()
//{
//	char *a[] = {"work","at","school"};//，指针数组，字符串w，a，s的首地址放在数组里面
//	char **pa = a;
//	pa++;
//	printf("%s\n",*pa);
//	return 0;
//}

int main()
{
	char *a[] = {"enter","new","point","first"};//先是指针数组a，存放的是每个字符串的第一个字符的地址
	char **pa[]= { a+3,a+2,a+1,a};//pa也是数组，存放的是a中指针的地址
	char ***pc = pa;//pc也是指针，指向的是a+3的地址，
	printf("%s\n",**++pc);//pc先加一，就转到a+2的地址，解引用就是a+2，再次对a+2就是字符P的地址，解引用就是打印Point
	printf("%s\n",*--*++pc + 3);//++的优先级比+要高，pc本来是a+2的地址，之后在加一就是a+1的地址，解引用是a+1，a+1再--就是a，a就是字符e的地址，解引用就是e，e再+3就是从第二个e开始打印
	printf("%s\n",*pc[-2] + 3);//pc根据上面是a+1的地址，之后pc[-2]，就相当于转为a+3的地址，解引用就是a+3，之后对a+3解引用是指向的字符F，F+3就是st
	printf("%s\n",pc[-1][-1] + 1);//pc是a+1的地址，pc-1解引用就是a+2，a+2-1就是a+1，对a+1解引用就是N，N+1就是EW
	return 0;
}