#define _CRT_SECURE_NO_WARNINGS 1
//今天学习的是操作符
#include <stdio.h>
//int main()
//{
//	//int a = 5 / 2;
//	//计算5/2.0时，数据类型不是整型，使用的是浮点型
//	double a = 5 / 2.0;
//	//printf("a = %d\n",a);
//	printf("a = %lf\n",a);//使用lf
//	return 0;
//}
//int main()
//{
//	int a = 16;//四个字节，就是32位
//	a = a >> 1;//右移操作符，移动的是二进制位 16的二进制位 10000前面还有27位
//	printf("%d\n",a);//移位到01000,十进制就是8
//	return 0;
//}
//算术右移：右边丢弃，左边补充的原符号位；（一般移位都是采用的算术右移）
//逻辑右移：右边丢弃，左边补充0；
//使用负数算一下；
//int main()
//{
//	int a = -1;
//	a = a >> 1;
//	printf("%d\n",a);
//	return 0;
//}
//整数在内存中存的是补码
//1000..........0001    原码
//1111..........1110    反码
//1111..........1111    补码
//1111..........1111    移位之后的
//int main()
//{
//	int a = 5;
//	a = a << 1;
//	printf("%d\n",a);
//	return 0 ;
//}
//左移操作符：左边抛弃,右边补0



//位操作符；
//int main()
//{
//	// &   按位与
//	int a = 1;
//	int b = 2;
//	int c = 0;
//	c = a&b;
//	printf("%d\n",c);
//	//a:000..............001
//	//b:000..............010
//	//c:000..............000
//	return 0;
//}
//& 按位与 ：有零为零

// | 按位或 ：有1为1 

// ^  按位异或 ：有1为1，11为零

//下面不是用临时变量，交换两个数；
//int main()
//{
//	int  a = 1;
//	int b = 2;
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//	printf("%d  %d\n",a,b);
//	return 0;
//}

//计算补码个数；
//int main()
//{
//	int i = 0;
//	int num = 0;
//	int count = 0;
//	printf("输入一个数：");
//	scanf("%d",&num);
//	//思想是：一个数与1按位与，看最后一位，是否为零，如果为零，补码个数加一。之后在进行右移操作，将三十二位都进行相同的计算
//	
//	while(i<32)
//	{
//		if(1 == (num & 1))
//		{
//			count++;
//			i++;
//			num = num >> 1;
//		}
//		else
//		{
//			i++;
//			num = num >> 1;
//		}
//	}
//	printf("%d \n",count);
//	return 0;
//}

